package com.example.ben.application;

public class QuestionLibrary7 {

    private String mQuestions [] = {
            "Οι τρεις ιδιότητες των υποπρογραμμάτων είναι:",
            "Ποιό/ποιά από τα παρακάτω ανήκουν στα πλεονεκτήματα του τμηματικού προγραμματισμού:",
            "Τι ισχύει για το πρόγραμμα? ",
            "Ποιός τύπος εμβέλειας συνίσταται σε έναν άπειρο προγραμματιστεί:",
            "Ποιά είναι τα δύο είδη των υποπρογραμμάτων",
            "Τι επιστέφει η συνάρτηση?",
            "Τι από τα παρακάτω ισχύει για τις συναρτήσεις",
            "Ποιό το αποτέλεσμα του προγράμματος για τιμές εισόδου α=2, β=3 ",
            "Ποιό το αποτέλεσμα του προγράμματος για τιμές εισόδου α-5, β=2",
            "Τι τιμές επιστρέφη η συνάρτηση",
            "Ποιο το αποτέλεσμα του προγράμματος"



    };

    private String mChoices [][] = {

            {"Κάθε υποπρόγραμμα έχει περισσότερες από μία εισόδους και εξόδους, είναι ανεξάρτητο από τα άλλα, είναι σχετικά μεγάλο", "Κάθε υποπρόγραμμα έχει μόνο μια είσοδο και έξοδο, είναι ανεξάρτητο από τα άλλα, δεν είναι σχετικάμεγάλο", "Κάθε υποπρόγραμμα έχει μία είσοδο αλλά πολλές εξόδους, έχει μια σχέση εξάρτησης με τα υπόλοιπα υποπρογράμματα, δεν είναι σχετικά μεγάλο", "Κάθε υποπρόγραμμα έχει μόνο μια είσοδο και έξοδο, έχει μια σχετική εξάρτηση με τα υπόλοιπα υποπρογράμματα, δεν είναι σχετικά μεγάλο"},
            {"Διευκόλυνση κατανόησης και διόρθωσης του προγράμματος", "Διευκόλυνση ανάπτυξης του αλγορίθμου και του αντίστοιχου προγράμματος", "Επέκταση των δυνατοτήτων των γλωσσών προγραμματισμού, μικρότερη χρονική απαίτηση και προσπάθεια στη συγγραφή του προγράμματος", "Ολα τα παραπάνω"},
            {"Είναι σωστό και εμφανίζει την τιμη του Υ που είναι 3", "Είναι λάθος γιατί στο ΓΡΑΨΕ έπρεπε να έχει το Β αντι για Υ", "Είναι σωστό και εμφανίζει την τιμη του Υ που είναι 1", "Δεν ισχύει τίποτα από τα παραπάνω"},
            {"Απεριόριστη εμβέλεια", "Περιορισμένη εμβέλεια", "Μερικώς περιορισμένη εμβέλεια", "Ολα τα παραπάνω"},
            {"Διαδικασίες και εκτελέσεις","Δομές και συναρτήσεις", "Ελενκτές και Διαμορφώσεις", "Διαδικασίες και συναρτήσεις"},
            {"Τις παραμέτρους x και y", "Τις παραμέτρους z και ΑΠΟΤ", "Την τιμή του z", "Την τιμή του ΑΠΟΤ"},
            {"Απαγορεύεται η χρήση εντολών εισόδου-εξόδου (διάβασε-γράψε)", "Η είσοδος τιμών της συνάρτησης πραγματοποιείται αποκλειστικά μέσο μεταβλητών της λίστας παραμέτρων", "Οι μεταβλητές διάφορετικών υποπρογραμμάτων και του κυρίου προγράμματος είναι ανεξάρτητες μεταξύ τους", "Ολα τα παραπάνω"},
            {"272", "176", "3", "Κανένα καθώς υπάρχει λάθος"},
            {"α=25, β=6", "α=25, β=4", "α=15, β=6", "Κανένα καθώς υπάρχρει λάθος στην κλήση της συνάρτησης"},
            {"εισοδ1=2, εισοδ2=3, χ=5, μο=2,5, ζ=3", "εισοδ1=2, εισοδ2=3, χ=5, μο=2,5, ζ=2", "εισοδ1=0, εισοδ2=0, χ=5, μο=2,5, ζ=3", "Καμία καθώς υπάρχει λάθος, γιατί δεν μπορεί δεχθεί τόσες τιμές η διαδικασία"},
            {"Κανενα καθώς δεν μπορει ένα πρόγραμμα να έχει και συνάρτηση και διαδικασία", "Κανένα καθώς δεν μπορεί να κλειθεί μια συνάρτηση από μια διαδικασία", "a=7, b=11, c=18", "a=3, b=6, z=18"}


    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.e16, R.drawable.a,R.drawable.a, R.drawable.e48, R.drawable.a, R.drawable.e50, R.drawable.e51, R.drawable.e52, R.drawable.e53
    };

    private String mCorrectAnswers[] = {"Κάθε υποπρόγραμμα έχει μόνο μια είσοδο και έξοδο, είναι ανεξάρτητο από τα άλλα, δεν είναι σχετικάμεγάλο", "Ολα τα παραπάνω", "Είναι σωστό και εμφανίζει την τιμη του Υ που είναι 1", "Περιορισμένη εμβέλεια", "Διαδικασίες και συναρτήσεις", "την τιμή του ΑΠΟΤ", "Ολα τα παραπάνω", "272", "Κανένα καθώς υπάρχρει λάθος στην κλήση της συνάρτησης", "εισοδ1=2, εισοδ2=3, χ=5, μο=2,5, ζ=3",  "a=3, b=6, z=18" };
    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}



