package com.example.ben.application;

public class QuestionBook3 {

    public static String[] questions = new String [] {
            "Κάθε γλώσσα προσδιορίζεται  από το αλφάβητό της,το λεξιλόγιό της, την γραμματική της και τη σημασιολογία της.",
            "Οι σημαντικότερη διαφορά μεταξύ της φυσικής και τεχνιτής γλώσσας είναι ότι τεχνητές γλώσσες συνεχώς εξελίσσονται. ",
            "Οι γλώσσες προγραμματισμού παραμένουν στάσιμες καθώς δεν μπορούν να βελτιωθούν.",
            "Η ποιό διαδεδομένη μέθοδολογία προγραμματισμού είναι ο τμηματικός προγραμματισμός. ",
            "Ο δομημένος προγραμματισμός συμβάλλει στην ανάπτυξη σύνθετων προγραμμάτων ,στην μείωση των λαθών,στην εύκολη κατανόηση προγραμμάτων καθώς και στις διορθώσεις τους. ",
            "Οι μεταγλωττιστές και οι διερμηνευτές συμβάλουν στην μετατροπή προγραμμάτων σε γλώσσα μηχανής. ",
            "Ο συντάκτης χρησιμοποιείται  για την σύνταξη και διόρθωση προγραμμάτων.",
            "Το παραγώμενο πρόγραμμα από τον μεταγλωττιστή ονομάζεται πηγαίο. ",
            "'Εχει αναπτυχθεί γλώσσα υψηλού επιπέδου που να επιλύει όλα τα είδη προβλημάτων",
            "Οι γλώσσες χαμηλού επιπέδου είναι ευκολότερες στην εκμάθηση",
            "Η GOTO έχει ως αποτέλεσμα την αλλαγή της ροής του προγράμματος σε μια άλλη εντολή του προγράμματος εκτός από την επόμενή της",
            "Η GOTO είναι απαραίτητη για τις σύγχρονες γλώσσες προγρμματισμου",
            "Ο μεταγλωττιστής δέχεται στην είσοδο ένα πρόγραμμα γραμμένο σε μια γλώσσα υψηλού επιπέδου και παράγει ένα ισοδύναμο πρόγραμμα σε γλώσσα μηχανής",
            "Τα προγράμματα σε γλώσσες χαμηλού επιπέδου είναι ευκολότερο να γραφτούν και να συντηρηθούν",
            "Ενα πρόγραμμα σε γλώσσα μηχανής χρειάζεται μεταγλώτττιση",
            "Οι γλώσσες προγραμματισμού αναπτύχθηκαν για την επικοινωνία ανθρώπου-υπολογιστή",
            "Το αλφάβητο μιας γλώσσας αποτελείται από το σύνολο των στοιχείων που χρησιμοποιείται από τη γλώσσα",
            "Σκοπός της ιεραρχικής σχεδίασης ενός προγράμματος είναι η διάσπασή του σε απλούστερα υποπροβλήματα",
            "Στον τμηματικό προγραμματισμό κάθε υποπρόβλημα αποτελεί ανεξάρτητη ενότητα",
            "Συντάκτης ονομάζεται το πρόγραμμα που χρησιμοποιείται για την αρχική σύνταξη και διόρθωση των προγραμμάτων"


    };

    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a
    };

    public static boolean[] answers = new boolean[]{
            true, false, false, false, true, true, true, false, false, false, true, false,
            true, false, false, true, true, true, true, true
    };


    public int getLength() {
        return questions.length;
    }

}




