package com.example.ben.application;

public class QuestionLibrary2 {

    private String mQuestions [] = {
            "Ποιές από τις παρακάτω είναι βασικές λειτουργίες των δομών δεδομένων?",
            "Με ποίον τρόπο γίνεται η δήλωση ενώς πίνακα:",
            "Ποίος είναι ο σκοπός του συγκεκριμένου αλγορίθμου? ",
            "Ο ποιό γρήγορος αλγόριθμος ταξινόμησης είναι:",
            "Οι δυναμικές δομές δεδομένων",
            "Τί κάνει ο παραπάνω αλγόριθμος?",
            "Aν ο χρήστης δώσει την τιμή 0 ποιά είναι τα αποτελέσματα του αλγορίθμου?",
            "Ποιός αλγόριθμος είναι ο παραπάνω?",
            "Τί αποτέλεσμα εφανίζει το παραπάνω τμήμα αλγορίθμο"



    };

    private String mChoices [][] = {

            {"είσοδος,  έξοδος,  καθοριστικότητα,  περατότητα, αποτελεσματικότητα", "αναζήτηση, ταξινόμηση, αντιγραφή, συνχώνευση, διαχωρισμός", "είσοδο, έξοδος, συνχώνευση, προσπέλαση", "καθοριστικότητα, ταξινόμηση, αποτελεσματικότητα, αντιγραφή, διαγραφή"},
            {"table", "table[i]", "(table)", "table(table)"},
            {"Βρίσκει το μέγιστο στοιχείο του πίνακα", "Υπολογίζει  το άθρισμα όλων των στοιχείων  του πίνακα", "Βρίσκει το ελάχιστο στοιχείο του πίνακα", "Αναθέτει διάφορες τιμλες του Α στον πίνακα"},
            {"Η ταξινόηση φυσαλίδας", "Η ταξινόμηση με επιλογή", "Η ταξινόμηση με παρεμβολή", "Η γρήγορη ταξινόμηση"},
            {"Αποθηκεύονται σε συνεχόμενς θέσεις μνήμης", "Αποθηκεύονται σε παράλληλες θέσσεις μνήμης","Αποθηκεύονται σε κρυφές θέσεις μνήμης", "Δεν αποθηκεύονται σε συνεχόμενες θέσοις μνήμης"},
            {"Υπολογίζει το άθροισμά των γραμμών του πίνακα", "Υπολογίζει το άθροισμα των στηλών του πίνακα", "Υπολογίζει το άθροισμα των γραμμών και των στηλών του πίνακα", "Υπολογίζει το συνολικό αθροισμα του πίνακα"},
            {"Αληθής και 0", "Αληθής και 10", "Ψευδής και 10", "Ψευδής και 1"},
            {"Ταξιμόμηση με επιλογή", "Ταξινόμηση με παρεμβολή", "Γρήγορη ταξινόμηση", "Ταξινόμηση φυσαλίδας" },
            {"Τίποτα καθώς δεν γίνεται να έχουμε αρνητικό βήμα", "Τοποθετεί το 0 στην δεύτερη θέση του πίνακα", "Τοποθετεί το 8 στην δεύτερη θέση του πίνακα","Τοποθετεί το 8 στην τρίτη θέση του πίνακα"}




    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.e8, R.drawable.a, R.drawable.a, R.drawable.e23, R.drawable.e24, R.drawable.e26, R.drawable.e27
    };

    private String mCorrectAnswers[] = {"αναζήτηση, ταξινόμηση, αντιγραφή, συνχώνευση, διαχωρισμός", "table[i]", "Βρίσκει το ελάχιστο στοιχείο του πίνακα","Η γρήγορη ταξινόμηση", "Δεν αποθηκεύονται σε συνεχόμενες θέσοις μνήμης", "Υπολογίζει το άθροισμα των γραμμών και των στηλών του πίνακα","Ψευδής και 1", "Ταξιμόμηση με επιλογή", "Τοποθετεί το 8 στην τρίτη θέση του πίνακα"};

    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}

