package com.example.ben.application;

public class QuestionBook5 {

    public static String[] questions = new String [] {
            "Πρέπει να αποφεύγουμε αν είναι δυνατόν η χρήση των εμφωλευμένων Αν και στην θέση τους να χρησιμοποιούνται απλούστερες δομές ",
            "Με βάση τους συγκριτικούς τελεστές η ισότητα εκφράζεται με τον τελεστή '<-'",
            "Οι συγκριτικοί τελεστές εκτελούνται πρίν από τους αριθμητικούς σε μία πρόταση.",
            "Οι εντολές που βρίσκονται σε  επανάληψη ΜΕΧΡΙΣ_ΟΤΟΥ εκτελούνται τουλάχιστον μία φορά ",
            "Οι λογικοί τελεστές εκτελούνται πριν από τους συγκριτικούς. ",
            "Είναι σωστή η σύνταξη της δομής επιλογής ΑΝ.",
            "Είναι σωστή η σύνταξη της δομής επανάληψης ΟΣΟ. ",
            "Είναι σωστή η σύνταξη της δομής επανάληψης ΜΕΧΡΙΣ_ΟΤΟΥ.",
            "Η συνθήκη ΜΕΧΡΙΣ_ΟΤΟΥ εκτελείται τουλάχιστον μία φορά. ",
            "Οταν γνωρίζουμε τον αριθμό των επαναλήψεων τότε αποφεύγουμε την δομή επανάληψης ΓΙΑ .. ΑΠΟ .. ΜΕΧΡΙ. ",
            "Το βήμα δηλώνει το πόσο αυξάνεται το i μετά το πέρας κάθε επανάληψης.",
            "Η δομή ΟΣΟ <συνθήκη> ΕΠΑΝΕΛΑΒΕ χρησιμοποιείται μόνο όταν γνωρίζουμε το πλήθως των επαναλήψεων",
            "Οταν ένας βρόχος είναι εμφολευμένος μέσα σε έναν άλλο,τότε ο βρόχος που ξεκινάει πρώτος πρέπει να ολοκληρωθεί πρώτος",
            "Στην συνθήκη ΓΙΑ..ΑΠΟ..ΜΕΧΡΙ είναι πάντα υποχρεωτικό να αναφέρεται το βήμα",
            "Οι εντολές που βρίσκονται σε επανάληψη  ΓΙΑ.. ΜΕΧΡΙ..  εκτελούντε τουλάχιστον μία φορά ",
            "Σε μια δομή επιλογής ΑΝ δεν είναι απαραίτητο να χρησιμοποιηθεί και η δομή ΑΛΛΙΩΣ_ΑΝ",
            "Ο παραπάνω τρόπος είναι σωστός για την αποθήκευση 100 αριθμών σε τρεις διαφορετικούς πίνακες με βάση το πρόσημο του αριθμού",
            "Με βάση τους συγκριτικούς τελεστές η ανισότητα εκφράζεται με τον τελεστή '<>'",
            "Κάθε επανάληψη που εκτελείται με την μια εντολή ΓΙΑ..ΑΠΟ..ΜΕΧΡΙΣ_ΟΤΟΥ μπορεί να υλοποιηθεί και με την χρήση των εντολών επανάληψης ΜΕΧΡΙΣ_ΟΤΟΥ",
            "Κάθε επανάληψη που εκτελείται με την μια εντολή ΓΙΑ..ΑΠΟ..ΜΕΧΡΙΣ_ΟΤΟΥ μπορεί να υλοποιηθεί και με την χρήση των εντολών επανάληψης ΟΣΟ_ΕΠΑΝΕΛΑΒΕ",


    };

    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a,R.drawable.a, R.drawable.a, R.drawable.e12, R.drawable.e13, R.drawable.e15, R.drawable.a, R.drawable.a, R.drawable.e14, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e35, R.drawable.a, R.drawable.a, R.drawable.a
    };

    public static boolean[] answers = new boolean[]{
            true, false, false, true, true, true, false, true, true, false, true, false, false, false, false, true, true, true, true, true
    };


    public int getLength() {
        return questions.length;
    }

}




