package com.example.ben.application;

public class QuestionLibrary3 {

    private String mQuestions [] = {
            "Οι τεχνικές σχεδίασης προγραμμάτων είναι: ",
            "Οι τρείς λογικές δομές που χρησιμοποιούντε στον δομημένο προγραμματισμό είναι οι:",
            "Ορισμένα από τα πλεονεκτήματα του δομημένου προγραμματισμού είναι:",
            "Με ποιά σειρά γίνεται η μεταγλώττιση και σύνθεση ενός προγράμματος:",
            "Τα συντακτικά λάθοι ανιχνεύονται",
            "Ποιά η τελική τιμή του Β αν ο χρήστης δώσει αρχικά Β=5",
            "Τί συμβαίνει στον παρακάτω αλγόριθμο με την εκετέλεση της εντολής GOTO 2",
            "Το πρόγραμμα που παράγεται από την μεταγλώττιση ονομάζεται",
            "Για την συγγραφή προγραμμάτων χρησιμοποιείται ",
            "Ποιά είναι τα είδη λαθών ενός προγράμματος?",
            "Τα λογικά λάθοι αντιμετωπίζονται",
            "Ποιά είναι τα προγράμματα και τα εργαλεία που περιέχει ένα προγραμματιστικό περιβάλλον "


    };

    private String mChoices [][] = {
            {"Παράλληλος και κατανεμημένος  προγραμματισμός", "Σχεδιαστικός και δομημένος προγραμματισμός", "Αντικειμενοστραφής και τμηματικός προγραμματισμός", "Ιεραρχική σχεδίαση προγράμματος ,τμηματικός και δομημένος  προγραμματισμός "},
            {"Δομή έναρξης, δομή επεξεργασίας, δομή εξόδου", "Δομή επιλογής, δομή επανάληψης, δομή ακολουθείας", "Δομή επιλογής, δομή επεξεργασίας, δομή διαγραφής", "Τίποτα από τα παραπάνω"},
            {"Δημιουργία απλούστερων προγραμμάτων, ευκολότερη διόρθωση και συντήρηση, άμεση μεταφορά αλγορίθμων σε προγράμματα", "Διευκόλυνση στην ανάγνωση και κατανόηση, άμεση μετατροπή προγραμμάτων σε αλγορίθμους", "Δημιουργία απλούστερων αλγορίθμων, ευκολία συνγραφής αλγορίθμου ", "Περιορισμός λαθών κατά την ανάπτυξη αλγορίθμου,παράλληλη επεξεργασία προγραμμάτων,διευκόλυνση ανάλησης του αλγορίθμου σε τμήματα"},
            {"Εκτελέσιμο πρόγραμμα,μεταγλωττιστής,αντικείμενο πρόγραμμα,συνδέτης, τελικό πρόγραμμα", "Αρχικό πρόγραμμα,συνδέτης,μεταγλωττιστής,αντικείμενο πρόγραμμα εκτελέσιμο πρόγραμμα", "Εκελέσιμο πρόγραμμα,μεταγλωττιστής,συνδέτης,αντικείμενο πρόγραμμα,τελικό πρόγραμμα", "Αρχικό πρόγραμμα,μεταγλωτιστής,αντικείμενο πρόγραμμα,συνδέτης,εκτελέσιμο πρόγραμμα"},
            {"Από τον προγραμματιστή", "Από τον υπολογιστή και τον προγραμματιστή", "Από τον μεταγλωττιστή και τον διερμηνευτή", "Από την μονάδα επεξεργασίας"},
            {"5", "6", "7", "8"},
            {"Ο αλγόριθμος τρέχει 2 φορές", "Ο αλγόριθμος προσπερνά τις 2 επόμενες σειρές μετά το GOTO 2","Ο αλγόριθμος προσπερνά όλες τις σειρές μέχρι να φτάσει στην ετικέτα 2","Δεν έχει καμία χρήση στον συγκεκριμένο αλγόριθμο"},
            {"Αρχικό", "Αντικείμενο", "Εκτελέσιμο", "Υποκείμενο"},
            {"Συντάκτης", "Συνδέτης", "Διερμηνευτής", "Εκτελεστής"},
            {"Φυσικά, Τεχνητά", "Λογικά, Συντακτικά", "Πραγματικά, Φανταστικά", "Λογικά, Τεχνητά"},
            {"Μόνο απο τον υπολογιστή", "Μόνο από τον προγραμματιστή", "Μόνο από  τον μεταγλωττιστή", "Από τον υπολογιστή και τον προγραμματιστή"},
            {"Διερμηνευτή, Σνδέτη, Εκτελεστή", "Συντάκτη, Μεταγλωττιστή, Διερμηνευτή", "Συνδέτη, Συντάκτη, Εκτελεστή", "Συντάκτη, Μεταγλωττιστή, Συνδέτη"}


    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e28, R.drawable.e29, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a
    };

    private String mCorrectAnswers[] = {"Ιεραρχική σχεδίαση προγράμματος ,τμηματικός και δομημένος  προγραμματισμός ", "Δομή επιλογής, δομή επανάληψης, δομή ακολουθείας", "Δημιουργία απλούστερων προγραμμάτων, ευκολότερη διόρθωση και συντήρηση, άμεση μεταφορά αλγορίθμων σε προγράμματα", "Αρχικό πρόγραμμα,μεταγλωτιστής,αντικείμενο πρόγραμμα,συνδέτης,εκτελέσιμο πρόγραμμα", "Από τον μεταγλωττιστή και τον διερμηνευτή", "5", "Ο αλγόριθμος προσπερνά όλες τις σειρές μέχρι να φτάσει στην ετικέτα 2","Αντικείμενο", "Συντάκτης", "Λογικά, Συντακτικά", "Μόνο απο τον υπολογιστή", "Συντάκτη, Μεταγλωττιστή, Συνδέτη"};

    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}


