package com.example.ben.application;

public class QuestionBook6 {
    public static String[] questions = new String [] {
            "Ο δείκτης είναι μιά μεταβλητή που δέχεται ως όνομα μόνο τις μεταβλητές i,j,k. ",
            "Πίνακας είναι ένα σύνολο αντικειμένων ιδίου αλλά και διαφορετικού τύπου, τα οποία αναφέρονται με ένα κοινό όνομα. ",
            "Κάθε ένα από τα αντικείμενα που απαρτίζουν τον πίνακα λέγεται στοιχείο του πίνακα. ",
            "Ενα από τα πλεονεκτήματα των πινάκων είναι η αποθήκευση πολλών τιμών οι οποίες δεν χάνονται και μπορούν να ξαναχρησιμοποιηθούν. ",
            "Eνα από τα πλεονεκτήματα των πινάκων είναι η διαχείριση πολλών δεδομένων διαφορτετικού τύπου. ",
            "Μονοδιάστατος πίνακας είναι μια δομή δεδομένων που μας επιτρέπει που μας επιτρέπει στο όνομα μιας μεταβλητής να καταχωρήσουμε περισσότερα από ένα στοιχεία διαφορετικού τύπου",
            "Ενας πίνακας μπορεί να δηλωθεί σε οποιοδήποτε σημείο ενός προγράμματος",
            "Με την δήλωση ενός πίνακα δεσμεύουμε τόσες θέσεις μνήμης όσες δηλώνει ο αριθμός μέσα στις αγκύλες κατά τη δήλωση του πίμακα",
            "Είναι σωστή η δήλωση ενός ακέραιου πίνακα 7 θέσεων",
            "Το συνολικό μέγεθος ενός πίνακα μπορεί να αλλάξει κατά την διάρκεια ενός προγράμματος",
            "Ολα τα στοιχεία του πίνακα πρέπει να είναι του ίδιου τύπου",
            "Η αναφορά σε ένα στοιχείο του πίνακα γίνεται με την βοήθεια ενός δείκτη",
            "Το παραπάνω τμήμα του προγράμματος εμφανίζει τους άρτιους αριθμούς του πίνακα",
            "Οι πίνακες μπορούν να χρησιμοποιούνται συνήθως όταν το πλήθος των δεδομένων είναι προκαθορισμένο από την εκφώνηση ",
            "Ενας πίνακας στον προγραμματισμό μπορεί να έχει μέχρι τρεις διαστάσεις",
            "Ο πίνακας Α έχει 3 γραμμές και 2 στήλες",
            "Είναι ένας σωστός τρόπος αρχικοποίησης ενός τρισδιάστατου πίνακα",
            "Στην μνήμη του υπολογιστή τα στοιχεία ενός δισδιάστατου πίνακα αποθηκεύονται σε συνεχόμενες θέσεις μνήμης",
            "Ενας τετραγωνικός πίνακας έχει τον ίσο αριθμό γραμμών και στηλών"
    };

    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.e38, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e42, R.drawable.a,
            R.drawable.a, R.drawable.e44, R.drawable.e45, R.drawable.a, R.drawable.a

    };

    public static boolean[] answers = new boolean[]{
            false, false, true, true, false, true, false, true, false, false, true, true, false, true, false, false,
            true, true, true
    };


    public int getLength() {
        return questions.length;
    }

}


