package com.example.ben.application;

public class QuestionBook {

    public static String[] questions = new String[]{
            "Αλγόριθμος είναι μια πεπερασμένη σειρά ενεργειών, αυστηρά καθορισμένων και εκτελέσιμων σε πεπερασμένο χρόνο, που στοχεύουν στην επίλυση ενός προβήματος.",
            "Ένας αλγόριθμος σε σε ψευδογλώσσα αρχίζει πάντα με την λέξη 'Aρχή' και τελείνει με την λέξη 'Tέλος_Ονομα Αλγορίθμου'.",
            "Σταθερές ονομάζονται οι προκαθορισμένες τιμές που δεν μεταβάλονται καθ’ όλη την διάρκεια εκτέλεσης ενός αλγορίθμου.",
            "Μεταβλητές ονομάζονται οι τιμές που  χρησιμοποιούνται για την αναπαράσταση στοιχείων δεδομένων οι οποίες μπορούν να μεταβάλονται κατα την διάρκεια του εκτέλεσης του αλγορίθμου. ",
            "Οι τελεστές διακρίνονται σε αριθμητικούς,μεταβλητούς και λογικούς.",
            "Η σύνταξη της δομής επιλογής είναι σωστή. ",
            "Η σύνταξη της δομής επανάληψης είναι σωστή.",
            "Το παραπάνω τμήμα εκτελείται 10 φορές ",
            "Η δομή επανάληψης 'Οσο <συνθήκη> επανέλαβε' εκτελείται πάντα τουλάχιστον μία φορα. ",
            "Στην δομή επιλογής οι εντολές που βρίσκονται μέσα στην συνθήκη εκτελούνται όταν η συνθήκη είναι αληθής.",
            "Ο βρόχος Για i από 2 μέχρι 2 εκτελείται μία φορα",
            "Σε μιά εντολή εκχώρησης δεν επιτρέπεται η χρήση σταθερών",
            "Οταν ο αριθμός των επαναλήψεων είναι άγνωστος μπορούμε να χρησιμοποιήσουμε την δομή Για .. μέχρις ότου ..",
            "Μία σταθερά μπορεί να αλλάξει τιμή κατά την διάρκεια εκτέλεσης ενός αλγορίθμου"

    };

    public static int[] images = new int[]{
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.d1, R.drawable.e2, R.drawable.e7, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a

    };

    public static boolean[] answers = new boolean[]{
            true, false, true, true, false, true, true, false, false, true, true, true, true, false, false,false
    };


    public int getLength() {
        return questions.length;
    }


}
