package com.example.ben.application;

public class QuestionLibrary {

    private String mQuestions [] = {
            "Κάθε αλγόριθμος πρέπει να έχει: ",
            "Οι τρόποι αναπαράστασης ενός αλγορίθμου είναι: ",
            "Δίνονται τα παρακάτω βήματα ενός αλγορίθμου.Ποία είναι η σωστή σειρά εκτέλεσής του?",
            "Πόσες φορές εκτελείαι το παραπάνω τμήμα αλγορίθμου?",
            "Τι αποτέλεσμα εφανίζει ο παραπάνω  αλγόριθμος?",
            "Πόσες φορές εκτελείται ο αλγόριθμος",
            "Τί τιμή πρέπει να δώσει ο χρήστης για να τερματιστεί ο αλγόριθμος?",
            "Τί αποτέλεσμα εμφανίζει ο Αλγόριθμος για εισερχόμενες τιμές α=2 και β=5?",
            "Εστω ότο ο χρήστης δίνει τις τιμές α=3 και β=2. Ποίο είναι το αποτέλεσμα που θα εμφανίσει ο αλγόριθμος?",
            "Ποιά η τιμή του κ μετά το τέλος του αλγορίθμου?",
            "Τι τιμή έχει το α μετά το τέλος της επανάληψης"


    };

    private String mChoices [][] = {
            {"Μόνο είσοδο και έξοδο", "Μόνο καθοριστικότητα, περατότητα και αποτελεσματικότητα", "Ολα τα παραπάνω", "Τίποτα από τα παραπάνω"},
            {"Με ελεύθερο κείμενο,διαγραμματικές τεχνικές,φυσική γλώσσα και κωδικοποίηση", "Μόνο με κωδικοποίηση", "Δεν γίνεται να αναπαραστήσουμε έναν αλγόριμο", "Με ελεύθερο κείμενο και με κωδικοποίηση"},
            {"Αρχή , εμφάνισε αποτέλεσμα, ζήτα δεδομένα, κάνε υπολογισμούς, τέλος", "Αρχή , ζήτα δεδομένα, κάνε υπολογισμούς, εμφάνισε αποτέλεσμα, τέλος", "Αρχή, κανέ υπολογισμούς, ζήτα δεδομένα, εμφάνισε αποτέλεσμα, τέλος", "Ολα τα παραπάνω είναι λάθος"},
            {"Απειρες", "4", "5", "9"},
            {"1","3","5","8"},
            {"1","2","Καμία","Απειρες"},
            {"0", "1", "Β", "-2"},
            {"Τίποτα καθώς υπάρχει λάθος και δεν μπορεί να εκτελεστεί", "5", "6", "2"},
            {"3", "6", "2", "4"},
            {"2", "5", "7", "υπάρχει ατέρμον βρόχος και δεν μπορεί να συνεχιστεί η εκτέλεση του αλγορίθμου"},
            {"Καμία τιμή καθώς δεν γίνεται να χρησιμοποιήσουμε αρνητικές τιμές στην δομή επανάληψης", "4", "5", "3"}


    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e3,
            R.drawable.e4, R.drawable.e5, R.drawable.e6, R.drawable.e19, R.drawable.e20, R.drawable.e21, R.drawable.e22
    };

    private String mCorrectAnswers[] = {"Ολα τα παραπάνω", "Με ελεύθερο κείμενο,διαγραμματικές τεχνικές,φυσική γλώσσα και κωδικοποίηση", "Αρχή , ζήτα δεδομένα, κάνε υπολογισμούς, εμφάνισε αποτέλεσμα, τέλος", "5", "5", "1", "-2", "2", "3", "υπάρχει ατέρμον βρόχος και δεν μπορεί να συνεχιστεί η εκτέλεση του αλγορίθμου", "4"};


    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}



