package com.example.ben.application;

public class QuestionLibrary4 {

    private String mQuestions [] = {
            "Η ιεραρχία που ισχύει στην εκτέλεση των πράξεων είναι: ",
            "Τα σχόλια τοποθετούνται πάντα",
            "Το MOD χρησιμοποιείται για τον υπολογισμό",
            "Το πρόγραμμα υπολογίζει σωστά το εμβαδόν ενώς τριγώνου?",
            "Το πρόγραμμα υπολογίζει σωστά το εμβαδόν ενώς τετραγώνου?",
            "Το πρόγραμμα υπολογίζει σωστά το εμβαδόν ενώς κύκλου?",
            "Το πρόγραμμα υπολογίζει σωστά το άθροισμα πέντε θετικών αριθμών",
            "Αν στο πρόγραμμα υπάρχει λογικό λάθος τότε το πρόγραμμα "



    };

    private String mChoices [][] = {
            {"Πολλαπλασιασμός και διαίρεση, ύψωση σε δύνμη, πρόσθεση και αφαίρεση", "Πρόσθεση και αφαίρεση, πολλαπλασιασμός και διαίρεση, ύψωση σε δύναμη", "Ύψωση σε δύναμη, πολλαπλασιασμός και διαίρεση, πρόσθεση και αφαίρεση", "Ύψωση σε δύναμη,πρόσθεση και αφαίρεση, πολλαπλασιασμός και διαίρεση"},
            {"Στην αρχή του προγράμματος", "Στο τέλος του προγράμματος", "Έξω από το πρόγραμμα", "Σε οποιοδίποτε σημείο του προγράμματος"},
            {"Διαίρεσης", "Πολλαπλασιασμού", "Πηλίκου", "Υπολοίπου"},
            {"Ναι", "Οχι, υπάρχει λογικό λάθος", "Οχι, υπάρχει συντακτικό λάθος", "Οχι, υπάρχει πρακτικό λάθος"},
            {"Ναι", "Οχι, υπάρχει λογικό λάθος", "Οχι, υπάρχει συντακτικό λάθος", "Οχι, υπάρχει πρακτικό λάθος"},
            {"Ναι", "Οχι, υπάρχει λογικό λάθος", "Οχι, υπάρχει συντακτικό λάθος", "Οχι, υπάρχει πρακτικό λάθος"},
            {"Ναι", "Οχι, υπάρχει λογικό λάθος", "Οχι, υπάρχει συντακτικό λάθος", "Οχι, υπάρχει λογικό και συντακτικό λάθος"},
            {"Σταματά η εκτέλεσή του", "Εμφανίζει μήνυμα λάθους", "Εκτελείται κανονικά εμφανίζοντας λάθος αποτέλεσμα", "Εκτελείται κανονικά εμφανίζοντας σωστά αποτελέσματα (αφού το λογικό λάθος δεν επηρεάζει το πρόγραμμα"}

    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e31, R.drawable.e32, R.drawable.e33, R.drawable.e34, R.drawable.a
    };

    private String mCorrectAnswers[] = {"Ύψωση σε δύναμη, πολλαπλασιασμός και διαίρεση, πρόσθεση και αφαίρεση","Σε οποιοδίποτε σημείο του προγράμματος", "Υπολοίπου", "Οχι, υπάρχει λογικό λάθος", "Ναι", "Οχι, υπάρχει συντακτικό λάθος", "Οχι, υπάρχει λογικό και συντακτικό λάθος", "Εκτελείται κανονικά εμφανίζοντας λάθος αποτέλεσμα"};

    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}


