package com.example.ben.application;

public class QuestionLibrary5 {

    private String mQuestions [] = {
            "Η δομή επανάληψης ΟΣΟ <συνθήκη> ΕΠΑΝΕΛΑΒΕ επαναλαμβάνεται όσο η συνθήκη είναι ",
            "Οι τρείς βασικοί τελεστές είναι:",
            "Τι θα εμφανίσει το παραπάνω τμήμα προγράμματος?",
            "Πότε θα τερματιστεί το παραπάνω τμήμα του προγράμματος? ",
            "Η δομή επανάληψης ΜΕΧΡΙΣ_ΟΤΟΥ επαναλαμβάνεται όσο η συνθήκη είναι",
            "Τι αποτέλεσμα εμφανίζει",
            "Τι ισχύει για τους εμφολευμένους βρόχους",
            "Για νά εκτελεστή η Εντολή2 τι πρέπει να ισχύει?"



    };

    private String mChoices [][] = {
            {"Θετική", "Αρνητική", "Αληθής", "Ψευδής"},
            {"Ναι, οχι, και", "Οχι , και, η", "Αν, και, η", "Ναι, οχι, η"},
            {"10", "20", "Τίτοποτα,καθώς υπάρχει λάθος", "14"},
            {"Οταν ο χρήστης δώσει την τιμή Χ=0 και η εξωτερική επανάληψη κανει 6  επαναλήψεις", "Οταν ο χρήστης δώσει την τιμή για Χ>=-2 και η εξωτερική επανάληψη κάνει 6 επαναλήψεις", "Οταν ο χρήστης δώση την τιμή  Χ=0 και η εξωτερική επανάληψη κάνει 5 επαναλήψεις", "Ποτέ, γιατί είναι ατέρμον βρόχος"},
            {"Θετική", "Αρνητική", "Αληθής", "Ψευδής"},
            {"2","11", "17", "Τίποτα καθώς υπάρχει λάθος"},
            {"Ο Εσωτερικός βρόχος πρέπει να βρίσκεται ολόκληρος μέσα στον εξωτερικό", "Η είσοδος σε κάθε βρόχο υποχρεωτικά γίνεται από την αρχή του", "Δεν μπορεί να χρησιμοποιηθεί η ίδια μεταβλητή ως μετρητής δύο η περισσότερων βρόχων όταν ο ένας είναι στο εσωτερικό του άλλου", "Ολα τα παραπάνω"},
            {"Η συνθήκη1 να ισχύει και η συνθήκη2 να ισχύει", "Η συνθήκη1 να ισχύει και η συνθήκη2 να μην ισχύει","Η συνθήκη1 να μην ισχύει και η συνθήκη2 να ισχύει","Να μην ιχύει ούτε η συνθήκη1 ούτε και η συνθήκη2"}
    };


    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.e17, R.drawable.e18, R.drawable.a, R.drawable.e36, R.drawable.a, R.drawable.e37
    };

    private String mCorrectAnswers[] = {"Αληθής", "Οχι , και, η", "14", "Οταν ο χρήστης δώσει την τιμή για Χ>=-2 και η εξωτερική επανάληψη κάνει 6 επαναλήψεις", "Ψευδής", "11", "Ολα τα παραπάνω","Η συνθήκη1 να μην ισχύει και η συνθήκη2 να ισχύει"};
    public int getLength(){
        return mQuestions.length;
    }


    public String getQuestions(int a) {
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a) {
        String choice1 = mChoices[a][0];
        return choice1;
    }

    public String getChoice2(int a) {
        String choice2 = mChoices[a][1];
        return choice2;
    }

    public String getChoice3(int a) {
        String choice3 = mChoices[a][2];
        return choice3;
    }

    public String getChoice4(int a) {
        String choice4 = mChoices[a][3];
        return choice4;
    }


    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }

}


