package com.example.ben.application;

public class QuestionBook2 {


    public static String[] questions = new String [] {
            "Δομή δεδομένων είναι ένα υπο-σύνολο αποθηκευμένων δεδομένων που υφίστανται επεξεργασία από ένα σύνολο λειτουργιών",
            "Κάθε δομή μπορεί να χρησιμοποιηθεί σε οποιοδήποτε πρόβλημα η εφαρμογή",
            "Ο υπολογιστής μπορεί να επεξεργαστεί τα στοιχεία ενός πίνακα που έχει το πολύ τρεις διαστάσεις",
            "Ορισμένες από της βασικές λειτουργίες των δομών δεδομένων είναι: είσοδος, έξοδος, προσπέλαση, ταξινόμηση. ",
            "Ορισμένες από της βασικές λειτουργίες των δομών δεδομένων είναι: εισαγωγή, αντιγραφή, διαγραφή, αναζήτηση. ",
            "Οι δομές δεδομένων διακρίνονται σε στατικές και δυναμικές",
            "Οι δυναμικές δομές δεδομένων αποθηκεύονται σε συνεχόμενες θέσεις μνήμης.",
            "Οι δυναμικές δομές δεδομένων βασίζονται στην τεχνική της δυναμικής παραχώρησης μνήμης. ",
            "Οι πίνακες στον προγραμματισμό μπορούν να έχουν μόνο μονοδιάστατη δομή. ",
            "Με τον όρο στατικές δομές δεδομένων εννοείται ότι το ακριβές μέγεθος της απαιτούμενης κύριας μνήμης καθορίζεται κατά τη στιγμή του προγραμματισμού τους,κατα συνεπεια κατά τη στιγμή μετάφρασής τους. ",
            "Οι πίνακες χρησιμεύουν για την αποθήκευση και την διαχείριση της στοίβας και της ουράς. ",
            "Οι ποιό περίπλοκες μέθοδοι αναζήτησης στοιχείου σε πίνακα είναι η σειριακή και η γραμμική",
            "Το παρακάτω  τμήμα αλγορίθμου αναζητά την θέση του Β μέσα στον πίνακα.Το παρακάτω  τμήμα αλγορίθμου αναζητά την θέση του Β μέσα στον πίνακα.",
            "Ο παραπάνω τρόπος είναι ο σωστός για την ταξινόμηση με τον αλγόριθμο φυσαλίδα. ",
            "Ο ποιό γρήγορος αλγόριθμος ταξινόμησης είναι η ταξινόμηση φυσαλίδας",
            "Οι ποιό απλοί αλγόριθμοι ταξινόμησης είναι η ταξινόμηση με επιλογή η ταξινόμηση με παρεμβολή. ",
            "Ενας πίνακας δεν μπορεί να περιέχει περισσότερες από μία φορες ένα στοιχείο με την ίδια τιμή",
            "Ο αλγόριθμος φυσαλίδας είναι ο μοναδικός αλγόριθμος ταξινόμησης",
            "Η μέθοδος σειριακής αναζήτησης χρησιμοποιείται σε περιπτώσεις που ο πίνακας είναι μη ταξινομημένος και μικρου μεγέθους",
            "Ενας πίνακας δεν μπορεί να περιέχει στοιχεία διαφορετικού τύπου",
            "Η συγχώνευση και ο διαχωρισμός δεν ανήκουν στις βασικές λειτουργείες των δομών δεδομένων",
            "Και οι δύο δομές επανάληψης έμφανίζουν πάντα το ίδιο αποτέλεσμα"




    };

    public static int[] images = new int [] {
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e9 , R.drawable.e10, R.drawable.a, R.drawable.a, R.drawable.a,
            R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.a, R.drawable.e25

    };

    public static boolean[] answers = new boolean[]{
            false, false, false, false, true, true, false, true, false, true, true, false, true, false, false, true, false, false, true, true, false, false
    };


    public int getLength() {
        return questions.length;
    }

}



